# Trực quan hóa dữ liệu
#### Họ và tên: Lê Hoàng Vũ
#### Mã sinh viên: 23A404156

****

**Khai báo thư viện**

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker
import numpy as np

**Đọc file dữ liệu**

In [9]:
df = pd.read_csv("Work_data.csv")
print("Thông tin về số bản ghi, thuộc tính: ", df.shape)

Thông tin về số bản ghi, thuộc tính:  (79, 3)

**Xem qua bộ dữ liệu**

In [11]:
print("10 dòng đầu của dữ liệu")
df.head(10)

10 dòng đầu của dữ liệu

   SoNamKinhNghiem  Luong NganhNghe
0                7   26.0    KeToan
1                4   13.8    KeToan
2                8   21.5    KeToan
3                9   24.0    KeToan
4                1    7.8    KeToan
5                2   10.0    KeToan
6                4   13.5    KeToan
7                5   15.8    KeToan
8                6   17.5    KeToan
9               10   26.1    KeToan

In [12]:
print("Toàn bộ bản ghi của dữ liệu")
df

Toàn bộ bản ghi của dữ liệu

    SoNamKinhNghiem  Luong NganhNghe
0                 7   26.0    KeToan
1                 4   13.8    KeToan
2                 8   21.5    KeToan
3                 9   24.0    KeToan
4                 1    7.8    KeToan
..              ...    ...       ...
74                8   22.5      Sale
75                5   16.7      Sale
76                9   25.4      Sale
77                6   18.9      Sale
78                8   22.7      Sale

[79 rows x 3 columns]

**Thông tin thống kê của dữ liệu**

In [13]:
df.describe()

       SoNamKinhNghiem      Luong
count        79.000000  79.000000
mean          5.367089  17.355696
std           3.105732   6.313391
min           0.000000   5.800000
25%           3.000000  12.600000
50%           6.000000  17.500000
75%           8.000000  22.750000
max          10.000000  27.600000